Tekla.Structures.ModelInternal.PolygonNode
The PolygonNode class represents flat geometry tree node.

Tekla.Structures.ModelInternal.PolygonNode.#ctor(Tekla.Structures.Model.Contour)
Instantiates a flat geometry tree node.
contourPoints: The contour points of the node.

Tekla.Structures.ModelInternal.PolygonNode.ContourPoints
The contour points of flat geometry.